{
  "employee": {
    "id": "4000741400013306668",
    "name": "Siarhei Berdachuk",
    "email": "siarhei.berdachuk@example.com",
    "seniority": "B1",
    "languageEnglish": "B2",
    "availabilityStatus": "available"
  },
  "summary": "With over 30 years of extensive experience in the field of IT, I have honed my skills and expertise to deliver exceptional results. One of my notable achievements includes successfully coordinating mixed teams consisting of both QA professionals and developers, showcasing my exceptional coordination abilities. Additionally, I have taken on the role of team technical leader and mentor, guiding and inspiring my colleagues to achieve their full potential. To stay updated with the latest advancements in the industry, I actively participate in Java courses as a trainer multiple times per year. As a strong advocate of test-driven development, I strive to instill this approach within teams, ensuring the delivery of high-quality software solutions.",
  "projects": [
    {
      "projectCode": "CSC-CRS",
      "projectName": "Content Runtime Services",
      "customerName": "Content Services Corporation",
      "companyName": "Content Services Corporation",
      "role": "Team Lead, Architect",
      "startDate": "2024-11-01",
      "endDate": "2026-01-31",
      "technologies": [
        "Java",
        "Spring Boot",
        "Microservices",
        "Istio",
        "Kiali",
        "Jaeger",
        "Sumologic",
        "Grafana",
        "OpsGenie",
        "New Relic",
        "OpenAI",
        "Azure OpenAI",
        "AWS Bedrock",
        "LLMs",
        "PostgreSQL",
        "pgvector",
        "RDF",
        "SPARQL",
        "Cypher",
        "SKOS",
        "Mockito",
        "AWS Fargate",
        "AWS Step Functions",
        "AWS S3",
        "AWS EC2",
        "AWS IAM",
        "AWS CloudFormation",
        "AWS Lambda",
        "AWS ECS",
        "AWS SNS",
        "AWS SQS",
        "AWS CloudWatch",
        "AWS DynamoDB",
        "MySQL",
        "Aurora",
        "IntelliJ IDEA",
        "JMeter",
        "GitHub",
        "Gradle",
        "AWS CLI",
        "Jenkins",
        "Sonar",
        "Confluence",
        "Docker",
        "Kubernetes",
        "Prometheus",
        "Neo4j",
        "GraphDB"
      ],
      "responsibilities": "Team leading and coordination. Analyze business requirements and provide clear estimations. Develop Spring Boot microservices for Concept Map UI application from scratch. Develop Generative AI Summarization platform from scratch: Spring Boot microservices, work with Azure, OpenAI and AWS Bedrock AI providers. Design and develop serverless application for subject indexing using generative AI and vector database (pgvector). Performance testing and monitoring for the microservices. Develop scalable solution deployed on AWS (load balancer, ASG on EC2 instances, etc.) for Neo4j database. Developing ETL pipelines to transform RDF data.",
      "industry": "Technology",
      "projectSummary": "Software Architecture and Engineering Services for Content Runtime Services to address the client's need for an efficient, scalable solution for managing and delivering content. Leveraged microservices architecture, cloud-based AI solutions, vector databases, and advanced graph data structures to enhance data modeling and retrieval capabilities."
    },
    {
      "projectCode": "TCS-RVM",
      "projectName": "AI-Powered Feedback System",
      "customerName": "TechCorp Systems, Inc.",
      "companyName": "TechCorp Systems, Inc.",
      "role": "Team Lead, Architect",
      "startDate": "2023-05-01",
      "endDate": "2024-09-30",
      "technologies": [
        "Java",
        "Spring Boot",
        "Spring Security",
        "REST API",
        "Python",
        "MongoDB",
        "Docker",
        "Apache Kafka"
      ],
      "responsibilities": "Analyze and gather requirements to ensure comprehensive understanding of business needs. Provide Software Architecture design to support the integration of new features and enhancements. Plan tasks and allocate resources for efficient project execution. Lead and manage the development team to ensure alignment with project goals. Oversee full-stack software development, including code quality and performance optimizations. Integrate the application with other external systems to ensure seamless interoperability.",
      "industry": "Technology",
      "projectSummary": "AI-powered feedback system to streamline internal performance reviews and feedback processes"
    },
    {
      "projectCode": "GRC-JAVA",
      "projectName": "MAGIC DMS & BONUS Java Development",
      "customerName": "Global Retail Corp",
      "companyName": "Global Retail Corp",
      "role": "Team Lead, Architect",
      "startDate": "2021-03-01",
      "endDate": "2023-05-31",
      "technologies": [
        "Java",
        "Spring Boot",
        "Spring",
        "Kubernetes",
        "AWS",
        "PostgreSQL",
        "Oracle RDBMS",
        "Apache Kafka",
        "AWS Lambda"
      ],
      "responsibilities": "Provide Software Architecture to modernize a legacy core system to new the technology stack and be able to run per tenant/market. The kick-off development process for the new technology stack. Create POCs and help other team members learn new technologies. Improve code quality by replacing legacy code with the modern solutions and test coverage. Separate monolith codebase and replace modules with new cloud-based AWS solutions.",
      "industry": "Retail",
      "projectSummary": "Services for Global Retail DMS and Bonus system modernization"
    },
    {
      "projectCode": "TCS-PLX",
      "projectName": "Customer Lead Generation Platform",
      "customerName": "TechCorp Systems, Inc.",
      "companyName": "TechCorp Systems, Inc.",
      "role": "Team Lead",
      "startDate": "2020-05-01",
      "endDate": "2021-02-28",
      "technologies": [
        "Java",
        "Spring",
        "Spring Cloud Gateway",
        "Node.js",
        "AWS Lambda",
        "PostgreSQL",
        "Amazon DynamoDB"
      ],
      "responsibilities": "Lead the team as both Team and Tech Lead, ensuring alignment with project objectives. Communicate effectively with both the development team and stakeholders to keep everyone informed and aligned. Coordinate multiple development streams to ensure consistent feature integration within the product. Oversee backend development and ensure smooth delivery of backend functionalities. Migrate legacy modules to AWS, including the implementation of NodeJS-based Lambda functions.",
      "industry": "Technology",
      "projectSummary": "Enable remote work on TechCorp projects via new engagement models and develop a digital platform for remote work"
    },
    {
      "projectCode": "FSG-MSM",
      "projectName": "FSG Credit Club Application",
      "customerName": "Financial Services Group Limited",
      "companyName": "Financial Services Group Limited",
      "role": "Team Lead",
      "startDate": "2019-03-01",
      "endDate": "2020-05-31",
      "technologies": [
        "Java",
        "REST API",
        "SOAP",
        "MongoDB",
        "Dropwizard",
        "Apache JMeter",
        "Gradle"
      ],
      "responsibilities": "Manage and coordinate the local development team to ensure smooth operations and project delivery. Improve development and delivery processes by implementing best practices and optimizing workflows. Facilitate day-to-day communication with the customer to align expectations and gather feedback. Develop and automate tests, including performance and business logic scripts, to ensure software reliability. Conduct code reviews and make critical technical decisions to enhance code quality and project outcomes.",
      "industry": "Finance",
      "projectSummary": "Support and development of FSG Credit Club application"
    },
    {
      "projectCode": "MED-CMS",
      "projectName": "Media CMS ARC CASL Production Support",
      "customerName": "Media Corporation",
      "companyName": "Media Corporation",
      "role": "Team Lead",
      "startDate": "2018-11-01",
      "endDate": "2019-03-31",
      "technologies": [
        "Java",
        "Cucumber",
        "BDD Frameworks",
        "Apache NiFi",
        "MySQL",
        "Adobe AEM"
      ],
      "responsibilities": "Develop data migration modules to transfer data from Arc to EAM, ensuring seamless data flow and system integration. Create BDD (Behavior-Driven Development) tests to automate the testing of the migration process, ensuring accuracy and reliability.",
      "industry": "Media",
      "projectSummary": "Production support of Media CMS called ARC CASL"
    },
    {
      "projectCode": "TRV-NET",
      "projectName": "REST Microservices for Travel Reservations",
      "customerName": "Travel Solutions International",
      "companyName": "Travel Solutions International",
      "role": "Team Lead",
      "startDate": "2018-04-01",
      "endDate": "2018-10-31",
      "technologies": [
        "Java",
        "Spring Boot",
        "REST API",
        "Web Services"
      ],
      "responsibilities": "Lead the development team in designing, creating, and maintaining RESTful microservices for flight, hotel, and car reservations. Automate performance and stress testing using Gatling to ensure the reliability and scalability of services.",
      "industry": "Travel",
      "projectSummary": "REST micro services for flights, hotels, cars reservation"
    },
    {
      "projectCode": "ISC-SRCH",
      "projectName": "Information Services Eikon Answers WEB Application",
      "customerName": "Information Services Corp",
      "companyName": "Information Services Corp",
      "role": "Team Lead",
      "startDate": "2015-11-01",
      "endDate": "2018-03-31",
      "technologies": [
        "Java",
        "Elasticsearch",
        "Cucumber",
        "BDD Frameworks",
        "Apache JMeter",
        "Web Services",
        "Apache Big Data"
      ],
      "responsibilities": "Extend and enhance the Information Services Eikon Answers web application by developing new UI modules, including visual suggestion and statistical forms. Create BDD (Behavior-Driven Development) tests to automate the testing of search services. Lead the migration from a legacy internal document transformation system to a new Big Data-based data ingestion process. Manage and coordinate the local development team to ensure successful project delivery.",
      "industry": "Information Services",
      "projectSummary": "Information Services Eikon Answers WEB application and related services"
    },
    {
      "projectCode": "CMS-CIRC",
      "projectName": "Communication Solutions Circuit Enterprise Tool",
      "customerName": "Communication Solutions",
      "companyName": "Communication Solutions",
      "role": "Key Engineer",
      "startDate": "2015-06-01",
      "endDate": "2015-09-30",
      "technologies": [
        "Java",
        "OSGi",
        "Apache Maven",
        "IBM WebSphere",
        "IntelliJ IDEA"
      ],
      "responsibilities": "Conduct comparison and testing between the legacy search subsystem and the Solr-based search implementation to ensure performance and accuracy. Replace Ganglia metrics with modern monitoring solutions to improve system observability. Perform code refactoring to enhance maintainability and optimize performance. Identify and fix bugs to ensure the stability and functionality of the system.",
      "industry": "Technology",
      "projectSummary": "Communication Solutions Circuit - enterprise communication tool / IBM Connector"
    },
    {
      "projectCode": "CMS-ARCH",
      "projectName": "Copyright Web Based License System",
      "customerName": "Content Management Services",
      "companyName": "Content Management Services",
      "role": "Key Engineer",
      "startDate": "2012-08-01",
      "endDate": "2015-05-31",
      "technologies": [
        "Java",
        "Spring",
        "REST API",
        "Apache Struts 2",
        "MySQL"
      ],
      "responsibilities": "Implement Spring Batch integration for automating specific tasks. Develop a REST client-server solution for managing users. Integrate Google Analytics to track and analyze user interactions. Create Gradle scripts for project build automation and version control. Redesign and update the data access implementation to enhance efficiency. Refactor the database access layer for improved performance and maintainability. Perform SQL performance analysis and tuning to optimize database queries. Troubleshoot and resolve complex application issues and internal problems. Mentor junior developers by assigning tasks, supervising their work, and conducting code reviews.",
      "industry": "Content Management",
      "projectSummary": "Improving copyright web based license system"
    },
    {
      "projectCode": "ELS-TRWD",
      "projectName": "Transwide Server Integration",
      "customerName": "European Logistics Solutions",
      "companyName": "European Logistics Solutions",
      "role": "Key Engineer",
      "startDate": "2011-06-01",
      "endDate": "2012-08-31",
      "technologies": [
        "Java",
        "XML",
        "XML Schema",
        "Web Services",
        "Oracle RDBMS",
        "Eclipse",
        "Apache Ant"
      ],
      "responsibilities": "Development new integration modules. Resolving customer problems in real time. Changing transformation logic. Production issues real time support. Communication with PM and identification new requirements. Junior developers mentoring, tasks assignments and supervising their work.",
      "industry": "Logistics",
      "projectSummary": "Carriers and Shippers were integrated with the Transwide server. The main work involved creating integration modules between the Transwide server and customers (carriers). More than 90 different message formats were transformed in both directions."
    }
  ]
}

